
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7640424731)



<pre><code>Error: Error creating Repository: googleapi: Error 400: invalid project: &#34;projects/gig-japan-398904/locations/asia-northeast1-a&#34;

  with google_artifact_registry_repository.artifact-repository,
  on main.tf line 13, in resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34;:
  13: resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {

::debug::Terraform exited with code 1.
::debug::stdout: google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be created%0A  &#43; resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A      &#43; create_time      = (known after apply)%0A      &#43; effective_labels = (known after apply)%0A      &#43; format           = &#34;DOCKER&#34;%0A      &#43; id               = (known after apply)%0A      &#43; location         = &#34;asia-northeast1-a&#34;%0A      &#43; mode             = &#34;STANDARD_REPOSITORY&#34;%0A      &#43; name             = (known after apply)%0A      &#43; project          = &#34;gig-japan-398904&#34;%0A      &#43; repository_id    = &#34;ikigai.app&#34;%0A      &#43; terraform_labels = (known after apply)%0A      &#43; update_time      = (known after apply)%0A%0A      &#43; docker_config {%0A          &#43; immutable_tags = true%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Agoogle_artifact_registry_repository.artifact-repository: Creating...%0A
::debug::stderr: %0AError: Error creating Repository: googleapi: Error 400: invalid project: &#34;projects/gig-japan-398904/locations/asia-northeast1-a&#34;%0A%0A  with google_artifact_registry_repository.artifact-repository,%0A  on main.tf line 13, in resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34;:%0A  13: resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/fb60bcf7-f201-478e-801d-eb649268739e/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be created
  + resource "google_artifact_registry_repository" "artifact-repository" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1-a"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "gig-japan-398904"
      + repository_id    = "ikigai.app"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_artifact_registry_repository.artifact-repository: Creating...

Error: Error creating Repository: googleapi: Error 400: invalid project: "projects/gig-japan-398904/locations/asia-northeast1-a"

  with google_artifact_registry_repository.artifact-repository,
  on main.tf line 13, in resource "google_artifact_registry_repository" "artifact-repository":
  13: resource "google_artifact_registry_repository" "artifact-repository" {

::debug::Terraform exited with code 1.
::debug::stdout: google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be created%0A  + resource "google_artifact_registry_repository" "artifact-repository" {%0A      + create_time      = (known after apply)%0A      + effective_labels = (known after apply)%0A      + format           = "DOCKER"%0A      + id               = (known after apply)%0A      + location         = "asia-northeast1-a"%0A      + mode             = "STANDARD_REPOSITORY"%0A      + name             = (known after apply)%0A      + project          = "gig-japan-398904"%0A      + repository_id    = "ikigai.app"%0A      + terraform_labels = (known after apply)%0A      + update_time      = (known after apply)%0A%0A      + docker_config {%0A          + immutable_tags = true%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Agoogle_artifact_registry_repository.artifact-repository: Creating...%0A
::debug::stderr: %0AError: Error creating Repository: googleapi: Error 400: invalid project: "projects/gig-japan-398904/locations/asia-northeast1-a"%0A%0A  with google_artifact_registry_repository.artifact-repository,%0A  on main.tf line 13, in resource "google_artifact_registry_repository" "artifact-repository":%0A  13: resource "google_artifact_registry_repository" "artifact-repository" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":13,"Program":"tfcmt","SHA1":"d1b84bf35c7a5e4f87f0fb5e83c079a810bb4661","Vars":{},"WorkflowName":"iaac_apply"} -->